package com.example.demo.controller;

import org.junit.jupiter.api.Assertions;
import org.junit.jupiter.api.Test;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;

@SpringBootTest
class BadWordCheckingTest {

    @Autowired
    controllers controllers;

    @Test
    void checkUsingBadWord1() throws IllegalStateException{
        String contents = "꼰대스러운 글 몇자 적어본다 고르곤 졸라 " +
                "역사 이래 아니 사실상 역사 이전부터 인간은 연애하고 결혼하고 애낳고 살아왔다. 침팬지 오랑우탄 고릴라와 같은 영장류와 호모에렉투스 네안데르타인 호모사피엔스같은 인간종의 결정적 차이는 결혼관습의 여부다." +
                "침팬지는 난교, 오랑우탄은 수컷과 암컷이 별도로 살지만 호모속의 인간만 결혼을 통해 공동 육아를 한다." +
                "결혼이란 문화의 진화 생물학적인 핵심 동인은 공동육아다. 출산과 육아문제가 아니라면 굳이 결혼할 이유도 없다. 이런 면에서 다음세대를 위한 부모 세대의 희생이기도 하다." +
                "결혼은 역사적으로 모든 문화권에서 모든 문명에서 모든 지역에서 공통적으로 나타난다." +
                "침팬지는 1년에 2주라는 가임기가 있지만 인간에게는 가임기가 없어서 1년 내내 섹스가 가능하다. 이 말은 즉슨 남녀가 평생 붙어 있을수 있고 수컷이 자식을 알아볼수 있어 공동육아가 가능해졌다는 이야기다. 침팬지와 오랑우탄 수컷은 자기 자식이 누군지 모른다. 하지만 인간 수컷은 알아본다." +
                "인간의 결혼 문화란것은 수십만년 아니 수백만년간의 호모속의 진화과정에서 유전자와 함께 각인된 인류의 유산이다." +
                "결혼을 불필요한 것으로 치부하고 가부장제의 억압이라는 둥의 되도 않는 관념은 기껏해야 오십년도 채 되지 않는 나이브한 치기어린 발상일 뿐이다." +
                "삼십만년 된 연애 결혼 육아로 이어지는 호모속의 관습은 브레인의 전반에 걸쳐 각인된 것이라 전두엽에서 그걸 페미사상과 딩크문화로 극복 가능한 문제가 아니다." +
                "만약 딩크니 어쩌고 하면서 결혼 안하고 출산 앙하고 육아 안하면 수십년 후 폐경이 다가오는 즈음부터 그로 인한 상실감과 소외감은 딩크로서 느끼는 자유로움을 압살하고도 남을것이다." +
                "인간이 가장 끔직히 두려워하는 감정은 고립감이다. 사회로부터의 고립이자 관계로부터의 소외야 말로 인간이 느끼는 가장 불행한 감정이다." +
                "범죄자를 처벌하는 감옥이라는 시설이 괜히 만들어진게 아니다. 감옥이 물리적인 고립장치라면 독거인생은 사회적인 고립장치로서 앞으로의 인생을 옥죌것이다." +
                "난임이나 장애등으로 인한 불가피한 선택이 아닌 이상 인간은 연애 결혼 출산 육아의.테크를 받아들일 수 밖에 없고 이 테크를 타지 않는 이상 인간이 겪는 가장 큰 고통에 시달리게 된다. " +
                "이는 진화생물학적으로 당연한 원리다. 인간이 모두 결혼도 안하고 출산도 안한다면 인간은 진즉 멸종했을거다. 인간을 비롯한 모든 생명체의 원동력이 유전자를 보전하는 것이라는 점을 생각한다면 생명의 동인을 스스로 삭제하는 딩크인생은 엄청난 고통으로 수렴할 수 밖에 없다." +
                "그러니 최선을 다해서 연애하고 때되면 결혼하고 애도 둘은 낳고 육아도 열심히 하면서 살아라. 게임 영화 여행 이런건 사십 넘어가면 재미 없어지고 헛헛해진다. " +
                "인간이 할 수 있는 가장 가치있는 일은 테레사수녀같이 다수에게 인생을 바치는 이타적 삶이 아닌 이상 새 생명을 낳고 기르는것 뿐이다." +
                "돈을 수십억 수백억 벌어도 인간으로서의 기본적 역할을 하지 않는다면 소용없는 일이다.";

        String test = controllers.test(contents);

        Assertions.assertEquals(test,"/");

    }

    @Test
    void checkUsingBadWord2() {
        String contents = "꼰대스러운 글 몇자 적어본다 18년 고르곤 졸라" +
                "역사 이래 아니 사실상 역사 이전부터 인간은 연애하고 결혼하고 애낳고 살아왔다. 침팬지 오랑우탄 고릴라와 같은 영장류와 호모에렉투스 네안데르타인 호모사피엔스같은 인간종의 결정적 차이는 결혼관습의 여부다." +
                "침팬지는 난교, 오랑우탄은 수컷과 암컷이 별도로 살지만 호모속의 인간만 결혼을 통해 공동 육아를 한다." +
                "결혼이란 문화의 진화 생물학적인 핵심 동인은 공동육아다. 출산과 육아문제가 아니라면 굳이 결혼할 이유도 없다. 이런 면에서 다음세대를 위한 부모 세대의 희생이기도 하다." +
                "결혼은 역사적으로 모든 문화권에서 모든 문명에서 모든 지역에서 공통적으로 나타난다." +
                "침팬지는 1년에 2주라는 가임기가 있지만 인간에게는 가임기가 없어서 1년 내내 섹스가 가능하다. 이 말은 즉슨 남녀가 평생 붙어 있을수 있고 수컷이 자식을 알아볼수 있어 공동육아가 가능해졌다는 이야기다. 침팬지와 오랑우탄 수컷은 자기 자식이 누군지 모른다. 하지만 인간 수컷은 알아본다." +
                "인간의 결혼 문화란것은 수십만년 아니 수백만년간의 호모속의 진화과정에서 유전자와 함께 각인된 인류의 유산이다." +
                "결혼을 불필요한 것으로 치부하고 가부장제의 억압이라는 둥의 되도 않는 관념은 기껏해야 오십년도 채 되지 않는 나이브한 치기어린 발상일 뿐이다." +
                "삼십만년 된 연애 결혼 육아로 이어지는 호모속의 관습은 브레인의 전반에 걸쳐 각인된 것이라 전두엽에서 그걸 페미사상과 딩크문화로 극복 가능한 문제가 아니다." +
                "만약 딩크니 어쩌고 하면서 결혼 안하고 출산 앙하고 육아 안하면 수십년 후 폐경이 다가오는 즈음부터 그로 인한 상실감과 소외감은 딩크로서 느끼는 자유로움을 압살하고도 남을것이다." +
                "인간이 가장 끔직히 두려워하는 감정은 고립감이다. 사회로부터의 고립이자 관계로부터의 소외야 말로 인간이 느끼는 가장 불행한 감정이다." +
                "범죄자를 처벌하는 감옥이라는 시설이 괜히 만들어진게 아니다. 감옥이 물리적인 고립장치라면 독거인생은 사회적인 고립장치로서 앞으로의 인생을 옥죌것이다." +
                "난임이나 장애등으로 인한 불가피한 선택이 아닌 이상 인간은 연애 결혼 출산 육아의.테크를 받아들일 수 밖에 없고 이 테크를 타지 않는 이상 인간이 겪는 가장 큰 고통에 시달리게 된다. " +
                "이는 진화생물학적으로 당연한 원리다. 인간이 모두 결혼도 안하고 출산도 안한다면 인간은 진즉 멸종했을거다. 인간을 비롯한 모든 생명체의 원동력이 유전자를 보전하는 것이라는 점을 생각한다면 생명의 동인을 스스로 삭제하는 딩크인생은 엄청난 고통으로 수렴할 수 밖에 없다." +
                "그러니 최선을 다해서 연애하고 때되면 결혼하고 애도 둘은 낳고 육아도 열심히 하면서 살아라. 게임 영화 여행 이런건 사십 넘어가면 재미 없어지고 헛헛해진다. " +
                "인간이 할 수 있는 가장 가치있는 일은 테레사수녀같이 다수에게 인생을 바치는 이타적 삶이 아닌 이상 새 생명을 낳고 기르는것 뿐이다." +
                "돈을 수십억 수백억 벌어도 인간으로서의 기본적 역할을 하지 않는다면 소용없는 일이다.";
        
        Assertions.assertThrows(IllegalStateException.class , () -> controllers.test(contents));

    }
    

}